In [9]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt

In [2]:
data = pd.read_csv("Automobile_data.csv")

## from given data set print first and last five rows

In [6]:
# top five
print(data.head(5))

# last five
print(data.tail(5))

   index      company   body-style  wheel-base  length engine-type  \
0      0  alfa-romero  convertible        88.6   168.8        dohc
1      1  alfa-romero  convertible        88.6   168.8        dohc
2      2  alfa-romero    hatchback        94.5   171.2        ohcv
3      3         audi        sedan        99.8   176.6         ohc
4      4         audi        sedan        99.4   176.6         ohc

  num-of-cylinders  horsepower  average-mileage    price
0             four         111               21  13495.0
1             four         111               21  16500.0
2              six         154               19  16500.0
3             four         102               24  13950.0
4             five         115               18  17450.0
    index     company body-style  wheel-base  length engine-type  \
56     81  volkswagen      sedan        97.3   171.7         ohc
57     82  volkswagen      sedan        97.3   171.7         ohc
58     86  volkswagen      sedan        97.3   171.7         ohc
59     87       volvo      sedan       104.3   188.8         ohc
60     88       volvo      wagon       104.3   188.8         ohc

   num-of-cylinders  horsepower  average-mileage    price
56             four          85               27   7975.0
57             four          52               37   7995.0
58             four         100               26   9995.0
59             four         114               23  12940.0
60             four         114               23  13415.0

## clean data and update csv file

In [31]:
data.dtypes

index                 int64
company              object
body-style           object
wheel-base          float64
length              float64
engine-type          object
num-of-cylinders     object
horsepower            int64
average-mileage       int64
price               float64
dtype: object

In [33]:
data_clean = pd.read_csv("Automobile_data.csv", 
                         na_values = {
                             "company":["?","n.a"],
                             "body-style":["?","n.a"],
                             "wheel-base":["?","n.a"],
                             "length":["?","n.a"],
                             "engine-type":["?","n.a"],
                             "num-of-cylinders":["?","n.a"],
                             "horsepower":["?","n.a"],
                             "average-mileage":["?","n.a"],
                             "price":["?","n.a"]})

## find the most expensive car company name

In [59]:
data_clean.loc[data_clean.price == data_clean.price.max(),["company", "price"]]

          company    price
35  mercedes-benz  45400.0

## count total cars per company

In [65]:
data.company.value_counts()

toyota           7
bmw              6
nissan           5
mazda            5
volkswagen       4
mercedes-benz    4
audi             4
mitsubishi       4
chevrolet        3
jaguar           3
alfa-romero      3
porsche          3
isuzu            3
honda            3
dodge            2
volvo            2
Name: company, dtype: int64

## find each company's highest priced car

In [76]:
# can also work:
# data.groupby["company"].price.max()
df_comp = data.groupby(["company"])
df_comp[["company", "price"]].max()

                     company    price
company
alfa-romero      alfa-romero  16500.0
audi                    audi  18920.0
bmw                      bmw  41315.0
chevrolet          chevrolet   6575.0
dodge                  dodge   6377.0
honda                  honda  12945.0
isuzu                  isuzu   6785.0
jaguar                jaguar  36000.0
mazda                  mazda  18344.0
mercedes-benz  mercedes-benz  45400.0
mitsubishi        mitsubishi   8189.0
nissan                nissan  13499.0
porsche              porsche  37028.0
toyota                toyota  15750.0
volkswagen        volkswagen   9995.0
volvo                  volvo  13415.0

## find the average mileage of each car making company

In [88]:
df_comp = data.groupby(["company"])
df_comp[["company","average-mileage"]].mean()

               average-mileage
company
alfa-romero          20.333333
audi                 20.000000
bmw                  19.000000
chevrolet            41.000000
dodge                31.000000
honda                26.333333
isuzu                33.333333
jaguar               14.333333
mazda                28.000000
mercedes-benz        18.000000
mitsubishi           29.500000
nissan               31.400000
porsche              17.000000
toyota               28.714286
volkswagen           31.750000
volvo                23.000000

## sort all cars by Price column

In [96]:
data_sort = data.sort_values(["price"], ascending=False)
data_sort.head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
35,47,mercedes-benz,hardtop,112.0,199.2,ohcv,eight,184,14,45400.0
11,14,bmw,sedan,103.5,193.8,ohc,six,182,16,41315.0
34,46,mercedes-benz,sedan,120.9,208.1,ohcv,eight,184,14,40960.0
46,62,porsche,convertible,89.5,168.9,ohcf,six,207,17,37028.0
12,15,bmw,sedan,110.0,197.0,ohc,six,182,15,36880.0

## concatenate two data frames using following conditions

Create two data frames using following two Dicts, Concatenate those two data frame and create a key for each data frame.

In [97]:
    GermanCars = {'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'], 
                  'Price': [23845, 171995, 135925 , 71400]}
    japaneseCars = {'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi '],
                    'Price': [29995, 23600, 61500 , 58900]}

In [112]:
df_german = pd.DataFrame.from_dict(GermanCars)
df_japan = pd.DataFrame.from_dict(japaneseCars)

cars_df = pd.concat([df_german, df_japan], keys = ["German","Japan"] )
cars_df

              Company   Price
German 0         Ford   23845
       1     Mercedes  171995
       2          BMV  135925
       3         Audi   71400
Japan  0       Toyota   29995
       1        Honda   23600
       2       Nissan   61500
       3  Mitsubishi    58900

## merge two data frame using following condition

In [113]:
Car_Price = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 
             'Price': [23845, 17995, 135925 , 71400]}
Car_Horsepower = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'],
                  'horsepower': [141, 80, 182 , 160]}

In [119]:
df_price = pd.DataFrame.from_dict(Car_Price)
df_horse = pd.DataFrame.from_dict(Car_Horsepower)

df_merge = pd.merge(df_price, df_horse, on="Company")
df_merge

  Company   Price  horsepower
0  Toyota   23845         141
1   Honda   17995          80
2     BMV  135925         182
3    Audi   71400         160